[{"name": "Honey Balsamic Chicken with Crispy Broccoli & Potatoes", "id": "52993", "imgsrc": "https://www.themealdb.com/images/media/meals/kvbotn1581012881.jpg", "ingr": ["5 Potatoes", "1 Broccoli", "2 cloves Garlic", "2 Chicken Breast", "  Balsamic Vinegar", "  Honey", "  Chicken Stock", "1 tbsp Butter", "1 tbsp Vegetable Oil", "1 tbsp Olive Oil", "  ", "  ", "  ", "  ", "  ", "  ", "  ", "  ", "  ", "  "], "instr": "2 Servings\r\n\r\n1. Preheat oven to 425 degrees. Wash and dry all produce. Cut potatoes into 1/2-inch-thick wedges. Toss on one side of a baking sheet with a drizzle of oil, salt, and pepper. (For 4 servings, spread potatoes out across entire sheet.) Roast on top rack for 5 minutes (we'll add the broccoli then). \r\n\r\n2. Meanwhile, cut broccoli florets into bite-size pieces, if necessary. Peel and finely chop garlic. In a small microwave-safe bowl, combine 1 TBSP olive oil (2 TBSP for 4 servings) and half the garlic. Microwave until garlic sizzles, 30 seconds. \r\n\r\n3. Once potatoes have roasted 5 minutes, remove sheet from oven and add broccoli to empty side; carefully toss with garlic oil, salt, and pepper. (For 4 servings, add broccoli to a second sheet.) Continue roasting until potatoes and broccoli are browned and crispy, 15-20 minutes more. \r\n\r\n4. While veggies roast, pat chicken dry with paper towels; season all over with salt and pepper. Heat a drizzle of oil in a large pan over medium-high heat. Add chicken and cook until browned and cooked through, 5-6 minutes per side. (If chicken browns too quickly, reduce heat to medium.) Turn off heat; set chicken aside to rest. Wash out pan. \r\n\r\n5. Heat pan used for chicken over medium-high heat. Add a drizzle of oil and remaining garlic; cook until fragrant, 30 seconds. Stir in vinegar, honey, stock concentrate, and 1/4 cup water (1/3 cup for 4 servings). Simmer until thick and glossy, 2-3 minutes. Remove from heat and stir in 1 TBSP butter (2 TBSP for 4). Season with salt and pepper. \r\n\r\n6. Return chicken to pan and turn to coat in glaze. Divide chicken, broccoli, and potatoes between plates. Spoon any remaining glaze over chicken and serve. ", "vid": ""}, {"name": "Christmas cake", "id": "52990", "imgsrc": "https://www.themealdb.com/images/media/meals/ldnrm91576791881.jpg", "ingr": ["200g Butter", "200g Muscovado Sugar", "200g Plain Flour", "4 Beaten Eggs", "50g Ground Almonds", "100ml Sherry", "85g Candied Peel", "85g Glace Cherry", "250g Raisins", "250g Currants", "100g  Pecan Nuts", "Grated zest of 1 Lemon", "1 ½ tbsp Mixed Spice", "1 ½ tbsp Rose water", "1/2 tsp Vanilla Extract", "1/2 tsp Baking Powder", "  ", "  ", "  ", "  "], "instr": "Heat oven to 160C/fan 140C/gas 3. Line the base and sides of a 20 cm round, 7.5 cm deep cake tin. Beat the butter and sugar with an electric hand mixer for 1-2 mins until very creamy and pale in colour, scraping down the sides of the bowl half way through. Stir in a spoonful of the flour, then stir in the beaten egg and the rest of the flour alternately, a quarter at a time, beating well each time with a wooden spoon. Stir in the almonds.\r\n\r\nMix in the sherry (the mix will look curdled), then add the peel, cherries, raisins, cherries, nuts, lemon zest, spice, rosewater and vanilla. Beat together to mix, then stir in the baking powder.\r\n\r\nSpoon mixture into the tin and smooth the top, making a slight dip in the centre. Bake for 30 mins, then lower temperature to 150C/fan 130C/gas 2 and bake a further 2-2¼ hrs, until a skewer insterted in the middle comes out clean. Leave to cool in the tin, then take out of the tin and peel off the lining paper. When completely cold, wrap well in cling film and foil to store until ready to decorate. The cake will keep for several months.", "vid": "https://www.youtube.com/watch?v=34yeL8TstO0"}, {"name": "Battenberg Cake", "id": "52894", "imgsrc": "https://www.themealdb.com/images/media/meals/ywwrsp1511720277.jpg", "ingr": ["175g Butter", "175g Caster Sugar", "140g Self-raising Flour", "50g Almonds", "½ tsp Baking Powder", "3 Medium Eggs", "½ tsp Vanilla Extract", "¼ teaspoon Almond Extract", "175g Butter", "175g Caster Sugar", "140g Self-raising Flour", "50g Almonds", "½ tsp Baking Powder", "3 Medium Eggs", "½ tsp Vanilla Extract", "¼ teaspoon Almond Extract", "½ tsp Pink Food Colouring", "200g Apricot", "1kg Marzipan", "Dusting Icing Sugar"], "instr": "Heat oven to 180C/160C fan/gas 4 and line the base and sides of a 20cm square tin with baking parchment (the easiest way is to cross 2 x 20cm-long strips over the base). To make the almond sponge, put the butter, sugar, flour, ground almonds, baking powder, eggs, vanilla and almond extract in a large bowl. Beat with an electric whisk until the mix comes together smoothly. Scrape into the tin, spreading to the corners, and bake for 25-30 mins – when you poke in a skewer, it should come out clean. Cool in the tin for 10 mins, then transfer to a wire rack to finish cooling while you make the second sponge.\r\nFor the pink sponge, line the tin as above. Mix all the ingredients together as above, but don’t add the almond extract. Fold in some pink food colouring. Then scrape it all into the tin and bake as before. Cool.\r\nTo assemble, heat the jam in a small pan until runny, then sieve. Barely trim two opposite edges from the almond sponge, then well trim a third edge. Roughly measure the height of the sponge, then cutting from the well-trimmed edge, use a ruler to help you cut 4 slices each the same width as the sponge height. Discard or nibble leftover sponge. Repeat with pink cake.\r\nTake 2 x almond slices and 2 x pink slices and trim so they are all the same length. Roll out one marzipan block on a surface lightly dusted with icing sugar to just over 20cm wide, then keep rolling lengthways until the marzipan is roughly 0.5cm thick. Brush with apricot jam, then lay a pink and an almond slice side by side at one end of the marzipan, brushing jam in between to stick sponges, and leaving 4cm clear marzipan at the end. Brush more jam on top of the sponges, then sandwich remaining 2 slices on top, alternating colours to give a checkerboard effect. Trim the marzipan to the length of the cakes.\r\nCarefully lift up the marzipan and smooth over the cake with your hands, but leave a small marzipan fold along the bottom edge before you stick it to the first side. Trim opposite side to match size of fold, then crimp edges using fingers and thumb (or, more simply, press with prongs of fork). If you like, mark the 10 slices using the prongs of a fork.\r\nAssemble second Battenberg and keep in an airtight box or well wrapped in cling film for up to 3 days. Can be frozen for up to a month.", "vid": "https://www.youtube.com/watch?v=aB41Q7kDZQ0"}, {"name": "Golabki (cabbage roll)", "id": "53021", "imgsrc": "https://www.themealdb.com/images/media/meals/q8sp3j1593349686.jpg", "ingr": ["1 Cabbage", "2 tbs Butter", "1 chopped Onion", "1 lb Ground Beef", "1/2 lb Ground Pork", "1 1/2 cups  Rice", "1 tsp  Garlic", "1 tsp  Salt", "1/4 tsp Black Pepper", "3 cans Tomato Puree", "  ", "  ", "  ", "  ", "  ", "  ", "  ", "  ", "  ", "  "], "instr": "Bring a large pot of lightly salted water to a boil. Place cabbage head into water, cover pot, and cook until cabbage leaves are slightly softened enough to remove from head, 3 minutes. Remove cabbage from pot and let cabbage sit until leaves are cool enough to handle, about 10 minutes.\r\n\r\nRemove 18 whole leaves from the cabbage head, cutting out any thick tough center ribs. Set whole leaves aside. Chop the remainder of the cabbage head and spread it in the bottom of a casserole dish.\r\n\r\nMelt butter in a large skillet over medium-high heat. Cook and stir onion in hot butter until tender, 5 to 10 minutes. Cool.\r\n\r\nStir onion, beef, pork, rice, garlic, 1 teaspoon salt, and 1/4 teaspoon pepper together in a large bowl.\r\n\r\nPreheat oven to 350 degrees F (175 degrees C).\r\n\r\nPlace about 1/2 cup beef mixture on a cabbage leaf. Roll cabbage around beef mixture, tucking in sides to create an envelope around the meat. Repeat with remaining leaves and meat mixture. Place cabbage rolls in a layer atop the chopped cabbage in the casserole dish; season rolls with salt and black pepper.\r\n\r\nWhisk tomato soup, tomato juice, and ketchup together in a bowl. Pour tomato soup mixture over cabbage rolls and cover dish wish aluminum foil.\r\n\r\nBake in the preheated oven until cabbage is tender and meat is cooked through, about 1 hour.", "vid": "https://www.youtube.com/watch?v=rBrTkDdoPYg"}, {"name": "Three Fish Pie", "id": "52882", "imgsrc": "https://www.themealdb.com/images/media/meals/spswqs1511558697.jpg", "ingr": ["1kg Potatoes", "Knob Butter", "Dash Milk", "50g Gruyere", "75g Butter", "2 sliced Leek", "75g Plain Flour", "150ml White Wine", "568ml Milk", "2 tbs chopped Parsley", "250g Salmon", "250g Haddock", "250g Smoked Haddock", "6 Eggs"], "instr": "Preheat the oven to 200C/400F/Gas 6 (180C fan).\r\nPut the potatoes into a saucepan of cold salted water. Bring up to the boil and simmer until completely tender. Drain well and then mash with the butter and milk. Add pepper and taste to check the seasoning. Add salt and more pepper if necessary.\r\nFor the fish filling, melt the butter in a saucepan, add the leeks and stir over the heat. Cover with a lid and simmer gently for 10 minutes, or until soft. Measure the flour into a small bowl. Add the wine and whisk together until smooth.\r\nAdd the milk to the leeks, bring to the boil and then add the wine mixture. Stir briskly until thickened. Season and add the parsley and fish. Stir over the heat for two minutes, then spoon into an ovenproof casserole. Scatter over the eggs. Allow to cool until firm.\r\nSpoon the mashed potatoes over the fish mixture and mark with a fork. Sprinkle with cheese.\r\nBake for 30-40 minutes, or until lightly golden-brown on top and bubbling around the edges.", "vid": "https://www.youtube.com/watch?v=Ds1Jb8H5Sg8"}]